Dlubal.RFEM5.LineLoad
Line load parameters.

Dlubal.RFEM5.LineLoad.No
Number

Dlubal.RFEM5.LineLoad.ID
Identifier

Dlubal.RFEM5.LineLoad.Comment
Comment

Dlubal.RFEM5.LineLoad.Tag
Tag

Dlubal.RFEM5.LineLoad.IsValid
Information if the object is valid or not (read only)

Dlubal.RFEM5.LineLoad.ReferenceTo
Type of reference objects

Dlubal.RFEM5.LineLoad.LineList
List of objects on which is the load defined.

Dlubal.RFEM5.LineLoad.Type
Type of line load

Dlubal.RFEM5.LineLoad.Distribution
Distribution of line load

Dlubal.RFEM5.LineLoad.Direction
Direction of line load

Dlubal.RFEM5.LineLoad.Magnitude1
Magnitude 1

Dlubal.RFEM5.LineLoad.Magnitude2
Magnitude 2

Dlubal.RFEM5.LineLoad.Magnitude3
Magnitude 3

Dlubal.RFEM5.LineLoad.DistanceA
Distance from the begin of line.

Dlubal.RFEM5.LineLoad.DistanceB
Distance from the end of line.

Dlubal.RFEM5.LineLoad.LoadArray
Array of loads

Dlubal.RFEM5.LineLoad.RelativeDistances
Relative distance in %

Dlubal.RFEM5.LineLoad.OverTotalLength
Load over total length of line